heatFlow_simulation/heat_transfer/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 306;

boundaryField
{
        inlet
    {
        type            fixedValue;
        value           uniform 306;
    }
    outlet
    {
        type            zeroGradient;
    }
    wallOuter
    {
        type            zeroGradient;
    }
    wallInner 
    {
        type            fixedValue;
        value           uniform 316;
    } 
    frontAndBack
    {
        type            empty;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
