heatFlow_simulation/heat_transfer/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
     inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    wallOuter
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           $internalField;
    }
    wallInner 
    {
         type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           $internalField;
    } 
    frontAndBack
    {
        type            empty;
    }


    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
